Tekla Open API Reference for Tekla Structures 2025
ViewCamera.DirectionVector Property
The camera direction (controls the camera pan and tilt).
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector DirectionVector { get; set; }
Public Property DirectionVector As Vector
	Get
	Set
Property Value
Type: Vector
See Also
Reference
ViewCamera Class
Tekla.Structures.Model.UI Namespace